<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads ImageJ and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.download.ImageJ</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Image Processing</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>ImageJ</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>ImageJ</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Image Processing and Analysis in Java. Open source software to read and write GIF, JPEG, and ASCII. Read BMP, DICOM, FITS, and more.</string>
			<key>developer</key>
			<string>Wayne Rasband</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh

rm -rf /Applications/ImageJ
</string>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Version (?P&lt;version&gt;[0-9a-z\.]*)</string>
				<key>url</key>
				<string>http://rsbweb.nih.gov/ij/notes.html</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>ij.jar</string>
				<key>url</key>
				<string>http://rsb.info.nih.gov/ij/upgrade/ij.jar</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>download/osx/ImageJ[0-9]*\.zip</string>
				<key>url</key>
				<string>http://rsbweb.nih.gov/ij/download.html</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>http://rsbweb.nih.gov/ij/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
