<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version Horizon Client for Mac.</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.download.VMwareHorizonClient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VMware-Horizon-Client</string>
		<key>SEARCH_PATTERN_PRODUCT_VERSION</key>
		<string>/web/vmware/details\?downloadGroup=CART\w+_MAC_\d+&amp;productId=\d+&amp;rPId=\d+</string>
		<key>SEARCH_PATTERN_DMG</key>
		<string>https://download3.vmware.com/software/view/viewclients/CART\w+/VMware-Horizon-Client-[\d.-]+.dmg</string>
		<key>SEARCH_URL_PRODUCT_VERSION</key>
		<string>https://my.vmware.com/en/web/vmware/info/slug/desktop_end_user_computing/vmware_horizon_clients/4_0</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_PRODUCT_VERSION%</string>
				<key>result_output_var_name</key>
				<string>download_url</string>
				<key>url</key>
				<string>%SEARCH_URL_PRODUCT_VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_DMG%</string>
				<key>result_output_var_name</key>
				<string>dmg_url</string>
				<key>url</key>
				<string>https://my.vmware.com%download_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%dmg_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VMware Horizon Client.app</string>
				<key>requirement</key>
				<string>identifier "com.vmware.horizon" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EG7KH642X6</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
