<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and notifies of a new XQuartz version</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.notify.XQuartz</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.pkg.XQuartz</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>message</key>
				<string>%NAME% - %version% downloaded!</string>
				<key>title</key>
				<string>New Version of %NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.scriptingosx.SharedProcessors/Notification</string>
		</dict>
	</array>
</dict>
</plist>
