<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and shows of a new XQuartz version</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.reveal.XQuartz</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.pkg.XQuartz</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>reveal_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.scriptingosx.SharedProcessors/RevealInFinder</string>
		</dict>
	</array>
</dict>
</plist>
