<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Uses parent pkg recipe to download latest XQuartz and assigns correct version number.</string>
		<key>Identifier</key>
		<string>com.github.scriptingosx.pkg.XQuartz</string>
		<key>Input</key>
		<dict/>
		<key>MinimumVersion</key>
		<string>0.2.5</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.download.xquartz</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%/XQuartz.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/XQuartzComponent.pkg/Payload</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PlistReader</string>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/Utilities/XQuartz.app</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/Utilities/XQuartz.app</string>
					<key>comment</key>
					<string>Blanking the expected_authority_names value from the parent recipe to prevent errors</string>
					<key>expected_authority_names</key>
					<string/>
					<key>strict_verification</key>
					<true/>
					<key>requirement</key>
					<string>(identifier "org.xquartz.X11" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = NA574AWV7E)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>source_pkg</key>
					<string>%pathname%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
