<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version DjView.</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.download.DjView</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DjView</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https*://sourceforge\.net/projects/djvu/files/DjVuLibre_MacOS/(?P&lt;version&gt;.*?)/DjVuLibre-.*?.dmg)</string>
		<key>SEARCH_URL</key>
		<string>http://sourceforge.net/projects/djvu/rss?path=/DjVuLibre_MacOS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>DjViewURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
