<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the Audacity DMG.</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.pkg.audacity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Audacity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.51</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%PKG%/Audacity.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
