<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Builds a pkg to install the latest version of the shellcheck binary.</string>
	<key>Identifier</key>
	<string>com.scriptingosx.pkg.shellcheck</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Shellcheck</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.scriptingosx.download.shellcheck</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>decompressor</key>
				<string>%RECIPE_DIR%/xz</string>
			</dict>
			<key>Comment</key>
			<string>Uses a custom processor to decompress .xz file</string>
			<key>Processor</key>
			<string>XZUnarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%decompressed_path%</string>
				<key>destination_path</key>
				<string>%RECIPE_DOWNLOADS_DIR%/Shellcheck</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>binary_path</key>
				<string>%destination_path%/shellcheck-%download_version%/shellcheck</string>
				<key>re_pattern</key>
				<string>ersion: (\d+\.\d+\.\d+)</string>
				<key>version_argument</key>
				<string>-V</string>
			</dict>
			<key>Comment</key>
			<string>retrieves the version from the binary</string>
			<key>Processor</key>
			<string>GetBinaryVersion</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>01775</string>
					<key>usr/local/</key>
					<string>0775</string>
					<key>usr/local/bin/</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Shellcheck</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%destination_path%/shellcheck-%download_version%/shellcheck</string>
				<key>target</key>
				<string>%pkgroot%/usr/local/bin/shellcheck</string>
			</dict>
			<key>Comment</key>
			<string>Move the binary into the pkgroot</string>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>/usr/local/bin/shellcheck</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.scriptingosx.pkg.shellcheck</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%/</string>
				</dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%decompressed_path%</string>
					<string>%RECIPE_DOWNLOADS_DIR%/Shellcheck</string>
					<string>%RECIPE_CACHE_DIR%/Shellcheck</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Clean up after ourselves.  Only thing left should be the .lzma and .dmg files.</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
