<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of the shellcheck binary.</string>
	<key>Identifier</key>
	<string>com.scriptingosx.download.shellcheck</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Shellcheck</string>
		<key>download_version</key>
		<string>stable</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/koalaman/shellcheck/releases/download/stable/shellcheck-%download_version%.darwin.x86_64.tar.xz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
