<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>DESCRIPTION HERE!</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.munki.Excalibur</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>TeX</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Excalibur</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>open source Macintosh spell-checker for LaTeX</string>
			<key>developer</key>
			<string>Open Source</string>
			<key>display_name</key>
			<string>Excalibur</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.3</string>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.download.Excalibur</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath=/Applications/TeX</string>
					<string>--requires=MacTeX</string>
				</array>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
