<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Excalibur.</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.download.Excalibur</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>http://excalibur.sourceforge.net/</string>
		<key>NAME</key>
		<string>Excalibur</string>
		<key>SEARCH_PATTERN</key>
		<string>"(?P&lt;url&gt;get\.php\?id=(?P&lt;version&gt;\d\d\d.?))"</string>
		<key>SEARCH_URL</key>
		<string>%BASE_URL%/downloads.html</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%BASE_URL%/%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
