<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Python3.</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.download.Python3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Python3</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https:\/\/www\.python\.org\/ftp\/python\/3\.\d+\.\d+\/python-3\.\d+.\d+-macosx10\.6\.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://www.python.org/downloads/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
