<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Copies Python3.mpkg from the dmg downloaded.</string>
    <key>Identifier</key>
    <string>com.github.scriptingosx.pkg.Python3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Python3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.scriptingosx.download.Python3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Python.mpkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Python.mpkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/Python.mpkg/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/Python.mpkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Python-%version%.mpkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
