<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of IMOD.

Valid values for ARCH include:
- "intel" (default, Intel)
- "arm64" (Apple Silicon)
</string>
	<key>Identifier</key>
	<string>com.github.scriptingosx.download.IMOD</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>intel</string>
		<key>NAME</key>
		<string>IMOD</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(osx/imod_[\d\.]+(_osx\d+)?_%ARCH%\.pkg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>http://bio3d.colorado.edu/imod/download.html</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://bio3d.colorado.edu/imod/%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: David Mastronarde (JNF2CPUCK9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
